Service - Payday Filing/Archive/V1/Employment Information/sample messages/body-ei-returnfile-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <ret1:fileRequest xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnEI.v1">
                        <ret2:fileHeader xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                            <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                                <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                                <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>1.0</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="ACCIRD">123041607</com:identifier>
                            <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">PSO</com:accountType>
                            <ret2:periodEndDate>2018-04-31</ret2:periodEndDate>
                            <ret2:majorFormType>EI</ret2:majorFormType>
                        </ret2:fileHeader>
                        <ret2:fileBody xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                            <ret2:standardFields>
                                <ret2:isNilReturn>false</ret2:isNilReturn>
                                <ret2:isFinalReturn>false</ret2:isFinalReturn>
                                <ret2:amendmentRequest>
                                    <ret2:isAmended>false</ret2:isAmended>
                                    <ret2:amendReason/>
                                    <ret2:amendDetails/>
                                </ret2:amendmentRequest>
                                <ret2:creditTransferRequest>
                                    <ret2:transferIRD>223456789</ret2:transferIRD>
                                    <ret2:transferAccountType>PSO</ret2:transferAccountType>
                                    <ret2:transferFilingPeriod>2017-05-31</ret2:transferFilingPeriod>
                                    <ret2:associatedCustomer>false</ret2:associatedCustomer>
                                    <ret2:transferAmount>1000.00</ret2:transferAmount>
                                </ret2:creditTransferRequest>
                            </ret2:standardFields>
                            <ret2:formFields xsi:type="ret1:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                                <ret1:isReverseReplace>false</ret1:isReverseReplace>
                                <ret1:payDayDate>2018-04-10</ret1:payDayDate>
                                <ret1:contactName>contactName</ret1:contactName>
                                <ret1:contactPhoneNumber>000555666</ret1:contactPhoneNumber>
                                <ret1:contactEmail>a@b.com</ret1:contactEmail>
                                <ret1:employeeFields>
                                    <ret1:employee>
                                        <ret1:irdNumber>123028198</ret1:irdNumber>
                                        <ret1:employeeName>Keith Kalish</ret1:employeeName>
                                        <ret1:taxCode>M</ret1:taxCode>
                                        <ret1:payPeriodStartDate>2015-07-31</ret1:payPeriodStartDate>
                                        <ret1:payPeriodEndDate>2017-07-31</ret1:payPeriodEndDate>
                                        <ret1:employmentStartDate>2017-12-01</ret1:employmentStartDate>
                                        <ret1:employeePayFrequency>MT</ret1:employeePayFrequency>
                                        <ret1:grossEarnings>1000.00</ret1:grossEarnings>
                                        <ret1:earningsNotLiableACC>1001.00</ret1:earningsNotLiableACC>
                                        <ret1:lumpSumIndicator>false</ret1:lumpSumIndicator>
                                        <ret1:payeSchedularTaxDeductions>1002.00</ret1:payeSchedularTaxDeductions>
                                        <ret1:childSupportCode>G</ret1:childSupportCode>
                                        <ret1:childSupportDeductions>1003.00</ret1:childSupportDeductions>
                                        <ret1:studentLoansDeductions>1004.00</ret1:studentLoansDeductions>
                                        <ret1:kiwisaverEmployerContributions>1005.00</ret1:kiwisaverEmployerContributions>
                                        <ret1:kiwisaverDeductions>1006.00</ret1:kiwisaverDeductions>
                                        <ret1:taxCreditPayrollDonations>1007.00</ret1:taxCreditPayrollDonations>
                                        <ret1:esctDeducted>1008.00</ret1:esctDeducted>
                                        <ret1:familyTaxCredits>1009.00</ret1:familyTaxCredits>
                                    </ret1:employee>
                                    <ret1:employee>
                                        <ret1:irdNumber>123037155</ret1:irdNumber>
                                        <ret1:employeeName>Ella James</ret1:employeeName>
                                        <ret1:taxCode>M</ret1:taxCode>
                                        <ret1:payPeriodStartDate>2015-07-31</ret1:payPeriodStartDate>
                                        <ret1:payPeriodEndDate>2017-07-31</ret1:payPeriodEndDate>
                                        <ret1:employmentStartDate>2019-02-01</ret1:employmentStartDate>
                                        <ret1:employeePayFrequency>MT</ret1:employeePayFrequency>
                                        <ret1:grossEarnings>1000.00</ret1:grossEarnings>
                                        <ret1:earningsNotLiableACC>1001.00</ret1:earningsNotLiableACC>
                                        <ret1:lumpSumIndicator>false</ret1:lumpSumIndicator>
                                        <ret1:payeSchedularTaxDeductions>1002.00</ret1:payeSchedularTaxDeductions>
                                        <ret1:childSupportCode>G</ret1:childSupportCode>
                                        <ret1:childSupportDeductions>1003.00</ret1:childSupportDeductions>
                                        <ret1:studentLoansDeductions>1004.00</ret1:studentLoansDeductions>
                                        <ret1:kiwisaverEmployerContributions>1005.00</ret1:kiwisaverEmployerContributions>
                                        <ret1:kiwisaverDeductions>1006.00</ret1:kiwisaverDeductions>
                                        <ret1:taxCreditPayrollDonations>1007.00</ret1:taxCreditPayrollDonations>
                                        <ret1:esctDeducted>1008.00</ret1:esctDeducted>
                                        <ret1:familyTaxCredits>1011.00</ret1:familyTaxCredits>
                                    </ret1:employee>
                                </ret1:employeeFields>
                                <ret1:totalGrossEarnings>1000.00</ret1:totalGrossEarnings>
                                <ret1:totalEarningsNotLiableACC>1001.00</ret1:totalEarningsNotLiableACC>
                                <ret1:totalPAYESchedularTaxDeductions>1002.00</ret1:totalPAYESchedularTaxDeductions>
                                <ret1:totalChildSupportDeductions>1003.00</ret1:totalChildSupportDeductions>
                                <ret1:totalStudentLoansDeductions>1004.00</ret1:totalStudentLoansDeductions>
                                <ret1:totalKiwisaverEmployerContributions>1005.00</ret1:totalKiwisaverEmployerContributions>
                                <ret1:totalKiwisaverDeductions>1006.00</ret1:totalKiwisaverDeductions>
                                <ret1:totalTaxCreditPayrollDonations>1007.00</ret1:totalTaxCreditPayrollDonations>
                                <ret1:totalESCTDeducted>1008.00</ret1:totalESCTDeducted>
                                <ret1:totalFamilyTaxCredits>1009.00</ret1:totalFamilyTaxCredits>
                                <ret1:totalAmountPayable>1010.00</ret1:totalAmountPayable>
                            </ret2:formFields>
                        </ret2:fileBody>
                    </ret1:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>